IoTChainCode/hardware_exploration/cc2540/cc2540.c
    //system event msg(key or ble r/w)
    if (events & SYS_EVENT_MSG)
    {
        pMsg=osal_msg_receive(g_taskid);
        if (pMsg!=NULL)
        {
            Sys_ProcessEvent((osal_event_hdr_t *)pMsg);
            osal_msg_deallocate(pMsg);//Release the OSAL message
        }
        // return unprocessed events
        return events^SYS_EVENT_MSG;
    }
    //self defined event(totally 16 event by bits)
    if (events & APP_EVENT_SWITCH)//central/peripheral
    {
        osal_start_timerEx(g_taskid,APP_EVENT_SWITCH,DELAY_WAIT);
        //check central status
        if (!g_adv)
        {
            for (i=0;i<g_multi;i++)
            {
                if (g_central[i].status!=STATE_CHARACTERISTIC)
                    continue;
                buffer[0]=CMD_DATA;
                send_data(buffer,1,&g_central[i],g_taskid);
                NPI_WriteTransport(buffer,1);
                GAPRole_TerminateConnection(g_central[i].handle_conn);//Terminate a link(host)
            }
        }
        //check peripheral status
        if (g_adv && multi_connect(ROLE_PERIPHERAL,NULL))
        {
            buffer[0]=RET_DATA;
            send_data(buffer,1,&g_peripheral,g_taskid);
            NPI_WriteTransport(buffer,1);
        }
        //adv switch
#if DEBUG==DEBUG_P || DEBUG==DEBUG_C
        if (g_turnover)
        {
            //g_turnover=FALSE;
            //once=TRUE;
#endif
        g_adv=!g_adv;
        GAPRole_SetParameter(GAPROLE_ADVERT_ENABLED,sizeof(uint8),&g_adv);
#if DEBUG==DEBUG_P || DEBUG==DEBUG_C
        }
#endif
        //central judgement
        if (!g_adv && multi_num(ROLE_CENTRAL)==NUM_CENTRAL)//master exceed maximum
            return events^APP_EVENT_SWITCH;
        //peripheral judgement
        if (g_adv && multi_num(ROLE_PERIPHERAL)==NUM_PERIPHERAL)//peripheral exceed maximum
            return events^APP_EVENT_SWITCH;
        //switch->initial
        osal_set_event(g_taskid,APP_EVENT_INITIAL);//for adv enable event
        
        return events^APP_EVENT_SWITCH;
    }
    if (events & APP_EVENT_INITIAL)//central/peripheral
    {
        //start device
#if DEBUG==DEBUG_P || DEBUG==DEBUG_C
        if (g_turnover)
        {
            g_turnover=FALSE;
#endif
        if (g_adv)
        {
            //set_role(GAP_PROFILE_PERIPHERAL);
            GAPRole_Init(8,GAP_PROFILE_PERIPHERAL);
            GAPRole_StartDevice(&gap_roles_cbs);//Start the Device(central/peripheral)
            NPI_WriteTransport("Init:Open Adv\r\n",12);
            HalLcdWriteString("Init:Open Adv",HAL_LCD_LINE_1);
            //peripheral auto(->init)
            //osal_start_timerEx(g_taskid,APP_EVENT_START,DELAY_ADV);
        }
        else
        {
            //set_role(GAP_PROFILE_CENTRAL);
            GAPRole_Init(8,GAP_PROFILE_CENTRAL);
            GAPRole_StartDevice(&gap_roles_cbs);//Start the Device(central/peripheral)
            NPI_WriteTransport("Init:Close Adv\r\n",12);
            HalLcdWriteString("Init:Close Adv",HAL_LCD_LINE_1);
        }
#if DEBUG==DEBUG_P || DEBUG==DEBUG_C
        }
#endif
        //goto scan(central)
        //if (!g_adv && g_init)
        //if (g_init)
        if (!g_adv)
            osal_set_event(g_taskid,APP_EVENT_SCAN);//osal_start_timerEx(g_taskid,APP_EVENT_SCAN,DELAY_GAP);
        
        return events^APP_EVENT_INITIAL;
    }
    else if (events & APP_EVENT_SCAN)//central
    {
        multi_del();
        npi_parse("AT+SCAN\r\n",9,g_taskid);
        return events^APP_EVENT_SCAN;
    }
    else if (events & APP_EVENT_CONNECT)//central
    {
        for (i=0;i<g_scannum;i++)
        {
            osal_memcpy(buffer,"AT+CONNECT0\r\n",13);
            buffer[10]='0'+i;
            npi_parse(buffer,13,g_taskid);
        }
        return events^APP_EVENT_CONNECT;
    }
#if 0
    else if (events & APP_EVENT_TRANSFER)//central
    {
        for (i=0;i<g_multi;i++)
        {
            if (g_central[i].status!=STATE_CHARACTERISTIC)
                continue;
            send_data(&value,1,&g_central[i],g_taskid);
            NPI_WriteTransport(&value,1);
            if (value=='C')
            {
                value='A';
                //GAPRole_TerminateConnection(g_central[i].handle_conn);//Terminate a link(host)
                //osal_start_timerEx(g_taskid,APP_EVENT_INITIAL,DELAY_GAP);//osal_set_event(g_taskid,APP_EVENT_INITIAL);maybe delete
            }
            else
            {
                value++;
                osal_start_timerEx(g_taskid,APP_EVENT_TRANSFER,DELAY_GAP);
            }/*
#else
            if (multi_connect(ROLE_CENTRAL,g_central[i].handle_conn))
            {
                buffer[0]=RET_EMERGENCY;
                buffer[1]=(uint8)g_switch;
                send_data(buffer,2,&g_central[i],g_taskid);
                GAPRole_TerminateConnection(g_central[i].handle_conn);//Terminate a link(host)
                //osal_start_timerEx(g_taskid,APP_EVENT_TRANSFER,DELAY_EMERGENCY);
            }
#endif*/
            /*
#elif VERSION==VERSION_DEMO
            if (g_m2m)
            {                
                if (!osal_memcmp(g_addr[DEVICE_CAMERA],g_central[i].addr,B_ADDR_LEN) && !osal_memcmp(g_addr[DEVICE_AIRCONDITIONER],g_central[i].addr,B_ADDR_LEN))
                    continue;
                buffer[0]=CMD_SWITCH;
                buffer[1]=SWITCH_ON;
                send_data(buffer,2,&g_central[i],g_taskid);
                GAPRole_TerminateConnection(g_central[i].handle_conn);//Terminate a link(host)
            }
            if (g_fire)
            {
                i=multi_find(g_phoneaddr);
                if (i==NUM_CENTRAL)
                    continue;
                buffer[0]=RET_FIRE;
                send_data(buffer,1,&g_central[i],g_taskid);
                GAPRole_TerminateConnection(g_central[i].handle_conn);//Terminate a link(host)
            }
            //osal_start_timerEx(g_taskid,APP_EVENT_INITIAL,DELAY_GAP);//osal_set_event(g_taskid,APP_EVENT_INITIAL);maybe delete
#endif*/
        }
        /*
#if VERSION==VERSION_DEMO
        if (g_m2m)
        {
            buffer[0]=RET_M2M;
            send_data(buffer,1,&g_peripheral,g_taskid);
            GAPRole_TerminateConnection(g_peripheral.handle_conn);//Terminate a link(host)
            g_turnover=TRUE;
            g_m2m=FALSE;
        }
#endif*/
        return events^APP_EVENT_TRANSFER;
    }
#endif
    /*
    else if (events & APP_EVENT_TIMEOUT)//central
    {
        if (g_timeout==TRUE)
        {
            GAPRole_TerminateConnection(handle_connect);//Terminate a link
            osal_start_timerEx(g_taskid,APP_EVENT_INITIAL,DELAY_GAP);//osal_set_event(g_taskid,APP_EVENT_INITIAL);
        }
        return events^APP_EVENT_TIMEOUT;
    }*/
    /*
#if VERSION==VERSION_MODULE
#if DEBUG==DEBUG_BOTH
    else if (events & APP_EVENT_CLOCK)
    {
        if (multi_connect(ROLE_PERIPHERAL,NULL))
        {
            buffer[0]=RET_CLOCK;
            buffer[1]=(uint8)g_switch;
            send_data(buffer,2,&g_peripheral,g_taskid);
            osal_start_timerEx(g_taskid,APP_EVENT_CLOCK,DELAY_CLOCK);
        }
        return events^APP_EVENT_CLOCK;
    }
#endif
#endif
#if VERSION==VERSION_DEMO
    else if (events & APP_EVENT_TEMPERATURE)
    {
        static bool once=FALSE;
        
        if (!once && math_mean()>VALVE_TEMPERATURE)
        {
            once=TRUE;
            g_fire=TRUE;
            //g_turnover=TRUE;//peripheral->central
            //peripheral auto(->start)
            //osal_set_event(task_id,APP_EVENT_INITIAL);
        }
        else
            osal_start_timerEx(g_taskid,APP_EVENT_TEMPERATURE,DELAY_GAP);
        return events^APP_EVENT_TEMPERATURE;
    }
#endif*/
    //Discard unknown events
    return 0;
}

//The order in this table must be identical to the task initialization calls below in osalInitTask.
//Priority from high->low for each tasks
const pTaskEventHandlerFn tasksArr[] =
{
    LL_ProcessEvent,                                                  // task 0,in lib
    Hal_ProcessEvent,                                                 // task 1,in hal_drivers.c
    HCI_ProcessEvent,                                                 // task 2,in lib
#if defined (OSAL_CBTIMER_NUM_TASKS)
    OSAL_CBTIMER_PROCESS_EVENT(osal_CbTimerProcessEvent),             // task 3,in osal_cbtimer.c
#endif
    L2CAP_ProcessEvent,                                               // task 4,in lib
    GAP_ProcessEvent,                                                 // task 5,in lib
    GATT_ProcessEvent,                                                // task 6,in lib
    SM_ProcessEvent,                                                  // task 7,in lib
    GAPRole_ProcessEvent,                                             // task 8,in peripheral/central.c
    GAPBondMgr_ProcessEvent,                                          // task 9,in gapbondmgr.c
    GATTServApp_ProcessEvent,                                         // task 10,in lib
    //
    App_ProcessEvent                                                // task 11,self define
};
const uint8 tasksCnt = sizeof( tasksArr ) / sizeof( tasksArr[0] );
uint16 *tasksEvents;

