IoTChainCode/hardware_exploration/cc2540/cc2540.c
void osalInitTasks( void )
{
    uint8 taskID=0;
    
    tasksEvents=(uint16 *)osal_mem_alloc(sizeof(uint16)*tasksCnt);
    osal_memset(tasksEvents,0,sizeof(uint16)*tasksCnt);
    //LL Task
    LL_Init(taskID++);
    //Hal Task
    Hal_Init(taskID++);
    //HCI Task
    HCI_Init(taskID++);
#if defined (OSAL_CBTIMER_NUM_TASKS)
    //Callback Timer Tasks
    osal_CbTimerInit(taskID);
    taskID+=OSAL_CBTIMER_NUM_TASKS;
#endif
    //L2CAP Task
    L2CAP_Init(taskID++);
    //GAP Task
    GAP_Init(taskID++);
    //GATT Task
    GATT_Init(taskID++);
    //SM Task
    SM_Init(taskID++);
    //Profiles
    GAPRole_Init(taskID,GAP_PROFILE_PERIPHERAL);
    GAPRole_Init(taskID,GAP_PROFILE_CENTRAL);
    taskID++;
    GAPBondMgr_Init(taskID++);
    GATTServApp_Init(taskID++);
    //Application
    App_Init(taskID);
}

//If device want to send out info, it should be act as a central to connect a peripheral.
//After finish the data transfer(central->peripheral or peripheral->central), then disconnect.
//Adv all the time, occasionally scan usable devices as a pulse.
void main(void)
{
    //Initialize hardware
    HAL_BOARD_INIT();//initial/stablelizate osc, open flash cache prefetch
    //Initialize board I/O
    InitBoard(OB_COLD);//OB_COLD:close led/interrupt(avoid interfere)
    //Initialze the HAL driver
    HalDriverInit();//initial timer/adc/dma/aes/lcd/led/uart/key/hid
    //Initialize NV system
    osal_snv_init();//snv:flash to conserve pair data or user define data(4KB)
    //Initialize LL
    //Initialize the operating system
    osal_init_system();//osal initial including memory malloc, info queue, timer, power management and sys task
    //Enable interrupts
    HAL_ENABLE_INTERRUPTS();//enable global interrupt
    //Final board initialization
    InitBoard(OB_READY);//initial key
#if defined (POWER_SAVING)
    //option 1: always in PM1
    //osal_pwrmgr_device( PWRMGR_ALWAYS_ON );
    //option 2: enter PM2 when in idle
    //osal_pwrmgr_device( PWRMGR_BATTERY );
    //option 3: enter PM3 to disconnect ble, stop broadcasting, disable all timers. It waken up only by outer interrupt
    osal_pwrmgr_device(PWRMGR_BATTERY);//low power option
#endif
    //Start OSAL: looping to check flag in each tasks and each events, assign specific proc initialed in osal_init_system
    osal_start_system();//No Return from here
}